---
title: TableMergedCell
classe: Autodesk.Revit.DB.TableMergedCell
namespace: Autodesk.Revit.DB
eredita: System.Object
revit: "2025"
revitapi: "25.4.30.0"
stato: auto
verbo: leggere
membri_n: 6
---

# TableMergedCell

!!! note "Scheda automatica"
    La corrispondenza C#→Python è generata dalle 7 Regole. Descrizione, tranello ed esempio sono **da rivedere** — contribuisci.

## La classe

_(una frase: cos'è e a cosa serve)_

## La corrispondenza

| nella doc (C#) | in python | tipo |
|---|---|---|
| `Int32 Bottom { get; set; }` | `tableMergedCell.Bottom` | Int32 |
| `Boolean IsValidObject { get; }` | `tableMergedCell.IsValidObject` | Boolean |
| `Int32 Left { get; set; }` | `tableMergedCell.Left` | Int32 |
| `Int32 Right { get; set; }` | `tableMergedCell.Right` | Int32 |
| `Int32 Top { get; set; }` | `tableMergedCell.Top` | Int32 |
| `Void Dispose()` | `tableMergedCell.Dispose()` | Void |

## Il tranello

_(ciò che la pagina non dice e ti farebbe sbagliare)_

## Lo script

```python
# esempio da completare
```